nedseb/codal-stm32/source/stm32/analog.cpp
/*
 *******************************************************************************
 * Copyright (c) 2016-2021, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#include "analog.h"

#include "lock_resource.h"
#include "stm32yyxx_ll_adc.h"

#ifdef __cplusplus
extern "C" {
#endif

/* Private_Variables */
#if (defined(HAL_ADC_MODULE_ENABLED) && !defined(HAL_ADC_MODULE_ONLY)) || \
    (defined(HAL_DAC_MODULE_ENABLED) && !defined(HAL_DAC_MODULE_ONLY))
static PinName g_current_pin = NC;
#endif

/* Private_Defines */
#if defined(HAL_ADC_MODULE_ENABLED) && !defined(HAL_ADC_MODULE_ONLY)

    #ifndef ADC_SAMPLINGTIME
        #if defined(ADC_SAMPLETIME_8CYCLES_5)
            #define ADC_SAMPLINGTIME ADC_SAMPLETIME_8CYCLES_5;
        #elif defined(ADC_SAMPLETIME_12CYCLES_5)
            #define ADC_SAMPLINGTIME ADC_SAMPLETIME_12CYCLES_5;
        #elif defined(ADC_SAMPLETIME_13CYCLES_5)
            #define ADC_SAMPLINGTIME ADC_SAMPLETIME_13CYCLES_5;
        #elif defined(ADC_SAMPLETIME_15CYCLES)
            #define ADC_SAMPLINGTIME ADC_SAMPLETIME_15CYCLES;
        #elif defined(ADC_SAMPLETIME_16CYCLES)
            #define ADC_SAMPLINGTIME ADC_SAMPLETIME_16CYCLES;
        #elif defined(ADC_SAMPLETIME_19CYCLES_5)
            #define ADC_SAMPLINGTIME ADC_SAMPLETIME_19CYCLES_5;
        #endif
    #endif /* !ADC_SAMPLINGTIME */

    /*
     * Minimum ADC sampling time is required when reading
     * internal channels so set it to max possible value.
     * It can be defined more precisely by defining:
     * ADC_SAMPLINGTIME_INTERNAL
     * to the desired ADC sample time.
     */
    #ifndef ADC_SAMPLINGTIME_INTERNAL
        #if defined(ADC_SAMPLETIME_480CYCLES)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_480CYCLES
        #elif defined(ADC_SAMPLETIME_384CYCLES)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_384CYCLES
        #elif defined(ADC_SAMPLETIME_810CYCLES_5)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_810CYCLES_5
        #elif defined(ADC_SAMPLETIME_640CYCLES_5)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_640CYCLES_5
        #elif defined(ADC_SAMPLETIME_601CYCLES_5)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_601CYCLES_5
        #elif defined(ADC_SAMPLETIME_247CYCLES_5)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_247CYCLES_5
        #elif defined(ADC_SAMPLETIME_239CYCLES_5)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_239CYCLES_5
        #elif defined(ADC_SAMPLETIME_160CYCLES_5)
            #define ADC_SAMPLINGTIME_INTERNAL ADC_SAMPLETIME_160CYCLES_5
        #else
            #error "ADC sampling time could not be defined for internal channels!"
        #endif
    #endif /* !ADC_SAMPLINGTIME_INTERNAL */

    #ifndef ADC_CLOCK_DIV
        #ifdef ADC_CLOCK_SYNC_PCLK_DIV4
            #define ADC_CLOCK_DIV ADC_CLOCK_SYNC_PCLK_DIV4
        #elif ADC_CLOCK_SYNC_PCLK_DIV2
            #define ADC_CLOCK_DIV ADC_CLOCK_SYNC_PCLK_DIV2
        #elif defined(ADC_CLOCK_ASYNC_DIV1)
            #define ADC_CLOCK_DIV ADC_CLOCK_ASYNC_DIV1
        #endif
    #endif /* !ADC_CLOCK_DIV */

    #ifndef ADC_REGULAR_RANK_1
        #define ADC_REGULAR_RANK_1 1
    #endif

/* Private Functions */
static uint32_t get_adc_channel(PinName pin, uint32_t* bank)
{
    uint32_t function = pinmap_function(pin, PinMap_ADC);
    uint32_t channel  = 0;
    switch (STM_PIN_CHANNEL(function)) {
    #ifdef ADC_CHANNEL_0
        case 0:
            channel = ADC_CHANNEL_0;
            break;
    #endif
        case 1:
            channel = ADC_CHANNEL_1;
            break;
        case 2:
            channel = ADC_CHANNEL_2;
            break;
        case 3:
            channel = ADC_CHANNEL_3;
            break;
        case 4:
            channel = ADC_CHANNEL_4;
            break;
        case 5:
            channel = ADC_CHANNEL_5;
            break;
        case 6:
            channel = ADC_CHANNEL_6;
            break;
        case 7:
            channel = ADC_CHANNEL_7;
            break;
        case 8:
            channel = ADC_CHANNEL_8;
            break;
        case 9:
            channel = ADC_CHANNEL_9;
            break;
        case 10:
            channel = ADC_CHANNEL_10;
            break;
        case 11:
            channel = ADC_CHANNEL_11;
            break;
        case 12:
            channel = ADC_CHANNEL_12;
            break;
        case 13:
            channel = ADC_CHANNEL_13;
            break;
        case 14:
            channel = ADC_CHANNEL_14;
            break;
        case 15:
            channel = ADC_CHANNEL_15;
            break;
    #ifdef ADC_CHANNEL_16
        case 16:
            channel = ADC_CHANNEL_16;
            break;
    #endif
        case 17:
            channel = ADC_CHANNEL_17;
            break;
    #ifdef ADC_CHANNEL_18
        case 18:
            channel = ADC_CHANNEL_18;
            break;
    #endif
    #ifdef ADC_CHANNEL_19
        case 19:
            channel = ADC_CHANNEL_19;
            break;
    #endif
    #ifdef ADC_CHANNEL_20
        case 20:
            channel = ADC_CHANNEL_20;
            break;
        case 21:
            channel = ADC_CHANNEL_21;
            break;
        case 22:
            channel = ADC_CHANNEL_22;
            break;
        case 23:
            channel = ADC_CHANNEL_23;
            break;
        case 24:
            channel = ADC_CHANNEL_24;
            break;
        case 25:
            channel = ADC_CHANNEL_25;
            break;
        case 26:
            channel = ADC_CHANNEL_26;
            break;
        #ifdef ADC_CHANNEL_27
        case 27:
            channel = ADC_CHANNEL_27;
            break;
        case 28:
            channel = ADC_CHANNEL_28;
            break;
        case 29:
            channel = ADC_CHANNEL_29;
            break;
        case 30:
            channel = ADC_CHANNEL_30;
            break;
        case 31:
            channel = ADC_CHANNEL_31;
            break;
        #endif
    #endif
        default:
            channel = 0;
            break;
    }
    #ifdef ADC_CHANNELS_BANK_B
    if (STM_PIN_ANALOG_CHANNEL_BANK_B(function)) {
        *bank = ADC_CHANNELS_BANK_B;
    }
    else {
        *bank = ADC_CHANNELS_BANK_A;
    }
    #else
    UNUSED(bank);
    #endif
    return channel;
}

