nedseb/codal-stm32/source/stm32/analog.cpp
    HAL_DAC_Stop(&DacHandle, dacChannel);

    if (HAL_DAC_DeInit(&DacHandle) != HAL_OK) {
        /* DeInitialization Error */
        return;
    }
}
#endif  // HAL_DAC_MODULE_ENABLED && !HAL_DAC_MODULE_ONLY

#if defined(HAL_ADC_MODULE_ENABLED) && !defined(HAL_ADC_MODULE_ONLY)
////////////////////////// ADC INTERFACE FUNCTIONS /////////////////////////////

/**
 * @brief ADC MSP Initialization
 *        This function configures the hardware resources used in this example:
 *           - Peripheral's clock enable
 *           - Peripheral's GPIO Configuration
 * @param hadc: ADC handle pointer
 * @retval None
 */
void HAL_ADC_MspInit(ADC_HandleTypeDef* hadc)
{
    /*##-1- Enable peripherals and GPIO Clocks #################################*/
    /* ADC Periph clock enable */
    if (hadc->Instance == ADC1) {
    #ifdef __HAL_RCC_ADC1_CLK_ENABLE
        __HAL_RCC_ADC1_CLK_ENABLE();
    #endif
    #ifdef __HAL_RCC_ADC12_CLK_ENABLE
        __HAL_RCC_ADC12_CLK_ENABLE();
    #endif
    }
    #ifdef ADC2
    else if (hadc->Instance == ADC2) {
        #ifdef __HAL_RCC_ADC2_CLK_ENABLE
        __HAL_RCC_ADC2_CLK_ENABLE();
        #endif
        #ifdef __HAL_RCC_ADC12_CLK_ENABLE
        __HAL_RCC_ADC12_CLK_ENABLE();
        #endif
    }
    #endif
    #ifdef ADC3
    else if (hadc->Instance == ADC3) {
        #ifdef __HAL_RCC_ADC3_CLK_ENABLE
        __HAL_RCC_ADC3_CLK_ENABLE();
        #endif
        #ifdef __HAL_RCC_ADC34_CLK_ENABLE
        __HAL_RCC_ADC34_CLK_ENABLE();
        #endif
        #if defined(ADC345_COMMON)
        __HAL_RCC_ADC345_CLK_ENABLE();
        #endif
    }
    #endif
    #ifdef ADC4
    else if (hadc->Instance == ADC4) {
        #ifdef __HAL_RCC_ADC34_CLK_ENABLE
        __HAL_RCC_ADC34_CLK_ENABLE();
        #endif
        #if defined(ADC345_COMMON)
        __HAL_RCC_ADC345_CLK_ENABLE();
        #endif
    }
    #endif
    #ifdef ADC5
    else if (hadc->Instance == ADC5) {
        #if defined(ADC345_COMMON)
        __HAL_RCC_ADC345_CLK_ENABLE();
        #endif
    }
    #endif
    #ifdef __HAL_RCC_ADC_CLK_ENABLE
    __HAL_RCC_ADC_CLK_ENABLE();
    #endif
    /* For STM32F1xx, STM32H7xx, and STM32MP1xx ADC prescaler is configured in
       SystemClock_Config (variant.cpp) */
    #if defined(__HAL_RCC_ADC_CONFIG) && !defined(STM32F1xx) && !defined(STM32H7xx) && !defined(STM32MP1xx)
    hsem_lock(CFG_HW_RCC_CRRCR_CCIPR_SEMID, HSEM_LOCK_DEFAULT_RETRY);
    /* ADC Periph interface clock configuration */
    __HAL_RCC_ADC_CONFIG(RCC_ADCCLKSOURCE_SYSCLK);
    hsem_unlock(CFG_HW_RCC_CRRCR_CCIPR_SEMID);
    #endif

    /* Configure ADC GPIO pin */
    if (!(g_current_pin & PADC_BASE)) {
        pinmap_pinout(g_current_pin, PinMap_ADC);
    }
}

/**
 * @brief  DeInitializes the ADC MSP.
 * @param  hadc: ADC handle
 * @retval None
 */
void HAL_ADC_MspDeInit(ADC_HandleTypeDef* hadc)
{
    #ifdef __HAL_RCC_ADC_FORCE_RESET
    __HAL_RCC_ADC_FORCE_RESET();
    #endif
    #ifdef __HAL_RCC_ADC_RELEASE_RESET
    __HAL_RCC_ADC_RELEASE_RESET();
    #endif

    if (hadc->Instance == ADC1) {
    #ifdef __HAL_RCC_ADC1_FORCE_RESET
        __HAL_RCC_ADC1_FORCE_RESET();
    #endif
    #ifdef __HAL_RCC_ADC1_RELEASE_RESET
        __HAL_RCC_ADC1_RELEASE_RESET();
    #endif
    #ifdef __HAL_RCC_ADC12_FORCE_RESET
        __HAL_RCC_ADC12_FORCE_RESET();
    #endif
    #ifdef __HAL_RCC_ADC12_RELEASE_RESET
        __HAL_RCC_ADC12_RELEASE_RESET();
    #endif
    #ifdef __HAL_RCC_ADC1_CLK_DISABLE
        __HAL_RCC_ADC1_CLK_DISABLE();
    #endif
    #ifdef __HAL_RCC_ADC12_CLK_DISABLE
        __HAL_RCC_ADC12_CLK_DISABLE();
    #endif
    }
    #ifdef ADC2
    else if (hadc->Instance == ADC2) {
        #ifdef __HAL_RCC_ADC2_FORCE_RESET
        __HAL_RCC_ADC2_FORCE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC2_RELEASE_RESET
        __HAL_RCC_ADC2_RELEASE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC12_FORCE_RESET
        __HAL_RCC_ADC12_FORCE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC12_RELEASE_RESET
        __HAL_RCC_ADC12_RELEASE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC2_CLK_DISABLE
        __HAL_RCC_ADC2_CLK_DISABLE();
        #endif
        #ifdef __HAL_RCC_ADC2_CLK_DISABLE
        __HAL_RCC_ADC2_CLK_DISABLE();
        #endif
    }
    #endif
    #ifdef ADC3
    else if (hadc->Instance == ADC3) {
        #ifdef __HAL_RCC_ADC3_FORCE_RESET
        __HAL_RCC_ADC3_FORCE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC3_RELEASE_RESET
        __HAL_RCC_ADC3_RELEASE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC34_FORCE_RESET
        __HAL_RCC_ADC34_FORCE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC34_RELEASE_RESET
        __HAL_RCC_ADC34_RELEASE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC3_CLK_DISABLE
        __HAL_RCC_ADC3_CLK_DISABLE();
        #endif
        #ifdef __HAL_RCC_ADC34_CLK_DISABLE
        __HAL_RCC_ADC34_CLK_DISABLE();
        #endif
        #if defined(ADC345_COMMON)
        __HAL_RCC_ADC345_FORCE_RESET();
        __HAL_RCC_ADC345_RELEASE_RESET();
        __HAL_RCC_ADC345_CLK_DISABLE();
        #endif
    }
    #endif
    #ifdef ADC4
    else if (hadc->Instance == ADC4) {
        #ifdef __HAL_RCC_ADC34_FORCE_RESET
        __HAL_RCC_ADC34_FORCE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC34_RELEASE_RESET
        __HAL_RCC_ADC34_RELEASE_RESET();
        #endif
        #ifdef __HAL_RCC_ADC34_CLK_DISABLE
        __HAL_RCC_ADC34_CLK_DISABLE();
        #endif
        #if defined(ADC345_COMMON)
        __HAL_RCC_ADC345_FORCE_RESET();
        __HAL_RCC_ADC345_RELEASE_RESET();
        __HAL_RCC_ADC345_CLK_DISABLE();
        #endif
    }
    #endif
    #ifdef ADC5
    else if (hadc->Instance == ADC5) {
        #if defined(ADC345_COMMON)
        __HAL_RCC_ADC345_FORCE_RESET();
        __HAL_RCC_ADC345_RELEASE_RESET();
        __HAL_RCC_ADC345_CLK_DISABLE();
        #endif
    }
    #endif
    #ifdef __HAL_RCC_ADC_CLK_DISABLE
    __HAL_RCC_ADC_FORCE_RESET();
    __HAL_RCC_ADC_RELEASE_RESET();
    __HAL_RCC_ADC_CLK_DISABLE();
    #endif
}

/**
 * @brief  This function will set the ADC to the required value
 * @param  pin : the pin to use
 * @param  resolution : resolution for converted data: 6/8/10/12/14/16
 * @retval the value of the adc
 */
uint16_t adc_read_value(PinName pin, uint32_t resolution)
{
    ADC_HandleTypeDef AdcHandle           = {};
    ADC_ChannelConfTypeDef AdcChannelConf = {};
    __IO uint16_t uhADCxConvertedValue    = 0;
    uint32_t samplingTime                 = ADC_SAMPLINGTIME;
    uint32_t channel                      = 0;
    uint32_t bank                         = 0;

