nedseb/codal-stm32/source/stm32/analog.cpp
    AdcHandle.State      = HAL_ADC_STATE_RESET;
    AdcHandle.DMA_Handle = NULL;
    AdcHandle.Lock       = HAL_UNLOCKED;
    /* Some other ADC_HandleTypeDef fields exists but not required */

    g_current_pin = pin; /* Needed for HAL_ADC_MspInit*/

    if (HAL_ADC_Init(&AdcHandle) != HAL_OK) {
        return 0;
    }

    AdcChannelConf.Channel = channel; /* Specifies the channel to configure into ADC */

    #if defined(STM32L4xx) || defined(STM32L5xx) || defined(STM32WBxx)
    if (!IS_ADC_CHANNEL(&AdcHandle, AdcChannelConf.Channel)) {
    #elif defined(STM32G4xx)
    if (!IS_ADC_CHANNEL(&AdcHandle, AdcChannelConf.Channel)) {
    #else
    if (!IS_ADC_CHANNEL(AdcChannelConf.Channel)) {
    #endif /* STM32L4xx || STM32WBxx */
        return 0;
    }
    #ifdef ADC_SCAN_SEQ_FIXED
    AdcChannelConf.Rank =
        ADC_RANK_CHANNEL_NUMBER; /* Enable the rank of the selected channels when not fully configurable */
    #else
    AdcChannelConf.Rank = ADC_REGULAR_RANK_1; /* Specifies the rank in the regular group sequencer */
    #endif
    #if !defined(STM32L0xx)
        #if !defined(STM32G0xx)
    AdcChannelConf.SamplingTime = samplingTime; /* Sampling time value to be set for the selected channel */
        #else
    AdcChannelConf.SamplingTime =
        ADC_SAMPLINGTIME_COMMON_1; /* Sampling time value to be set for the selected channel */
        #endif
    #endif
    #if !defined(STM32F0xx) && !defined(STM32F1xx) && !defined(STM32F2xx) && !defined(STM32F4xx) && \
        !defined(STM32F7xx) && !defined(STM32G0xx) && !defined(STM32L0xx) && !defined(STM32L1xx) && \
        !defined(STM32F373xC) && !defined(STM32F378xx)
    AdcChannelConf.SingleDiff   = ADC_SINGLE_ENDED; /* Single-ended input channel */
    AdcChannelConf.OffsetNumber = ADC_OFFSET_NONE;  /* No offset subtraction */
    #endif
    #if !defined(STM32F0xx) && !defined(STM32F1xx) && !defined(STM32F2xx) && !defined(STM32G0xx) &&   \
        !defined(STM32L0xx) && !defined(STM32L1xx) && !defined(STM32WBxx) && !defined(STM32F373xC) && \
        !defined(STM32F378xx)
    AdcChannelConf.Offset = 0; /* Parameter discarded because offset correction is disabled */
    #endif
    #if defined(STM32H7xx) || defined(STM32MP1xx)
    AdcChannelConf.OffsetRightShift       = DISABLE; /* No Right Offset Shift */
    AdcChannelConf.OffsetSignedSaturation = DISABLE; /* Signed saturation feature is not used */
    #endif

    /*##-2- Configure ADC regular channel ######################################*/
    if (HAL_ADC_ConfigChannel(&AdcHandle, &AdcChannelConf) != HAL_OK) {
        /* Channel Configuration Error */
        return 0;
    }

    #if defined(STM32F0xx) || defined(STM32F1xx) || defined(STM32F3xx) || defined(STM32G0xx) || defined(STM32G4xx) || \
        defined(STM32H7xx) || defined(STM32L0xx) || defined(STM32L4xx) || defined(STM32MP1xx) || defined(STM32WBxx)
        /*##-2.1- Calibrate ADC then Start the conversion process ####################*/
        #if defined(STM32F0xx) || defined(STM32G0xx) || defined(STM32F1xx) || defined(STM32F373xC) || \
            defined(STM32F378xx)
    if (HAL_ADCEx_Calibration_Start(&AdcHandle) != HAL_OK)
        #elif defined(STM32H7xx) || defined(STM32MP1xx)
    if (HAL_ADCEx_Calibration_Start(&AdcHandle, ADC_CALIB_OFFSET, ADC_SINGLE_ENDED) != HAL_OK)
        #else
    if (HAL_ADCEx_Calibration_Start(&AdcHandle, ADC_SINGLE_ENDED) != HAL_OK)
        #endif
    {
        /* ADC Calibration Error */
        return 0;
    }
    #endif

    /*##-3- Start the conversion process ####################*/
    if (HAL_ADC_Start(&AdcHandle) != HAL_OK) {
        /* Start Conversation Error */
        return 0;
    }

    /*##-4- Wait for the end of conversion #####################################*/
    /*  For simplicity reasons, this example is just waiting till the end of the
        conversion, but application may perform other tasks while conversion
        operation is ongoing. */
    if (HAL_ADC_PollForConversion(&AdcHandle, 10) != HAL_OK) {
        /* End Of Conversion flag not set on time */
        return 0;
    }

    /* Check if the continous conversion of regular channel is finished */
    if ((HAL_ADC_GetState(&AdcHandle) & HAL_ADC_STATE_REG_EOC) == HAL_ADC_STATE_REG_EOC) {
        /*##-5- Get the converted value of regular channel  ########################*/
        uhADCxConvertedValue = HAL_ADC_GetValue(&AdcHandle);
    }

    if (HAL_ADC_Stop(&AdcHandle) != HAL_OK) {
        /* Stop Conversation Error */
        return 0;
    }

    if (HAL_ADC_DeInit(&AdcHandle) != HAL_OK) {
        return 0;
    }

    if (__LL_ADC_COMMON_INSTANCE(AdcHandle.Instance) != 0U) {
        LL_ADC_SetCommonPathInternalCh(__LL_ADC_COMMON_INSTANCE(AdcHandle.Instance), LL_ADC_PATH_INTERNAL_NONE);
    }
    return uhADCxConvertedValue;
}
#endif /* HAL_ADC_MODULE_ENABLED && !HAL_ADC_MODULE_ONLY*/

#if defined(HAL_TIM_MODULE_ENABLED) && !defined(HAL_TIM_MODULE_ONLY)

////////////////////////// PWM INTERFACE FUNCTIONS /////////////////////////////

void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef* htim_pwm)
{
    // Enable TIM clock
    #if defined(TIM1_BASE)
    if (htim_pwm->Instance == TIM1) {
        __HAL_RCC_TIM1_CLK_ENABLE();
    }
    #endif
    #if defined(TIM2_BASE)
    if (htim_pwm->Instance == TIM2) {
        __HAL_RCC_TIM2_CLK_ENABLE();
    }
    #endif
    #if defined(TIM3_BASE)
    if (htim_pwm->Instance == TIM3) {
        __HAL_RCC_TIM3_CLK_ENABLE();
    }
    #endif
    #if defined(TIM4_BASE)
    if (htim_pwm->Instance == TIM4) {
        __HAL_RCC_TIM4_CLK_ENABLE();
    }
    #endif
    #if defined(TIM5_BASE)
    if (htim_pwm->Instance == TIM5) {
        __HAL_RCC_TIM5_CLK_ENABLE();
    }
    #endif
    #if defined(TIM6_BASE)
    if (htim_pwm->Instance == TIM6) {
        __HAL_RCC_TIM6_CLK_ENABLE();
    }
    #endif
    #if defined(TIM7_BASE)
    if (htim_pwm->Instance == TIM7) {
        __HAL_RCC_TIM7_CLK_ENABLE();
    }
    #endif
    #if defined(TIM8_BASE)
    if (htim_pwm->Instance == TIM8) {
        __HAL_RCC_TIM8_CLK_ENABLE();
    }
    #endif
    #if defined(TIM9_BASE)
    if (htim_pwm->Instance == TIM9) {
        __HAL_RCC_TIM9_CLK_ENABLE();
    }
    #endif
    #if defined(TIM10_BASE)
    if (htim_pwm->Instance == TIM10) {
        __HAL_RCC_TIM10_CLK_ENABLE();
    }
    #endif
    #if defined(TIM11_BASE)
    if (htim_pwm->Instance == TIM11) {
        __HAL_RCC_TIM11_CLK_ENABLE();
    }
    #endif
    #if defined(TIM12_BASE)
    if (htim_pwm->Instance == TIM12) {
        __HAL_RCC_TIM12_CLK_ENABLE();
    }
    #endif
    #if defined(TIM13_BASE)
    if (htim_pwm->Instance == TIM13) {
        __HAL_RCC_TIM13_CLK_ENABLE();
    }
    #endif
    #if defined(TIM14_BASE)
    if (htim_pwm->Instance == TIM14) {
        __HAL_RCC_TIM14_CLK_ENABLE();
    }
    #endif
    #if defined(TIM15_BASE)
    if (htim_pwm->Instance == TIM15) {
        __HAL_RCC_TIM15_CLK_ENABLE();
    }
    #endif
    #if defined(TIM16_BASE)
    if (htim_pwm->Instance == TIM16) {
        __HAL_RCC_TIM16_CLK_ENABLE();
    }
    #endif
    #if defined(TIM17_BASE)
    if (htim_pwm->Instance == TIM17) {
        __HAL_RCC_TIM17_CLK_ENABLE();
    }
    #endif
    #if defined(TIM18_BASE)
    if (htim_pwm->Instance == TIM18) {
        __HAL_RCC_TIM18_CLK_ENABLE();
    }
    #endif
    #if defined(TIM19_BASE)
    if (htim_pwm->Instance == TIM19) {
        __HAL_RCC_TIM19_CLK_ENABLE();
    }
    #endif
    #if defined(TIM20_BASE)
    if (htim_pwm->Instance == TIM20) {
        __HAL_RCC_TIM20_CLK_ENABLE();
    }
    #endif
    #if defined(TIM21_BASE)
    if (htim_pwm->Instance == TIM21) {
        __HAL_RCC_TIM21_CLK_ENABLE();
    }
    #endif
    #if defined(TIM22_BASE)
    if (htim_pwm->Instance == TIM22) {
        __HAL_RCC_TIM22_CLK_ENABLE();
    }
    #endif
}

void HAL_TIM_PWM_MspDeInit(TIM_HandleTypeDef* htim_pwm)
{
    // Enable TIM clock
    #if defined(TIM1_BASE)
    if (htim_pwm->Instance == TIM1) {
        __HAL_RCC_TIM1_CLK_DISABLE();
    }
    #endif
    #if defined(TIM2_BASE)
    if (htim_pwm->Instance == TIM2) {
        __HAL_RCC_TIM2_CLK_DISABLE();
    }
    #endif
    #if defined(TIM3_BASE)
    if (htim_pwm->Instance == TIM3) {
        __HAL_RCC_TIM3_CLK_DISABLE();
    }
    #endif
    #if defined(TIM4_BASE)
    if (htim_pwm->Instance == TIM4) {
        __HAL_RCC_TIM4_CLK_DISABLE();
    }
    #endif
    #if defined(TIM5_BASE)
    if (htim_pwm->Instance == TIM5) {
        __HAL_RCC_TIM5_CLK_DISABLE();
    }
    #endif
    #if defined(TIM6_BASE)
    if (htim_pwm->Instance == TIM6) {
        __HAL_RCC_TIM6_CLK_DISABLE();
    }
    #endif
    #if defined(TIM7_BASE)
    if (htim_pwm->Instance == TIM7) {
        __HAL_RCC_TIM7_CLK_DISABLE();
    }
    #endif
    #if defined(TIM8_BASE)
    if (htim_pwm->Instance == TIM8) {
        __HAL_RCC_TIM8_CLK_DISABLE();
    }
    #endif
    #if defined(TIM9_BASE)
    if (htim_pwm->Instance == TIM9) {
        __HAL_RCC_TIM9_CLK_DISABLE();
    }
    #endif
    #if defined(TIM10_BASE)
    if (htim_pwm->Instance == TIM10) {
        __HAL_RCC_TIM10_CLK_DISABLE();
    }
    #endif
    #if defined(TIM11_BASE)
    if (htim_pwm->Instance == TIM11) {
        __HAL_RCC_TIM11_CLK_DISABLE();
    }
    #endif
    #if defined(TIM12_BASE)
    if (htim_pwm->Instance == TIM12) {
        __HAL_RCC_TIM12_CLK_DISABLE();
    }
    #endif
    #if defined(TIM13_BASE)
    if (htim_pwm->Instance == TIM13) {
        __HAL_RCC_TIM13_CLK_DISABLE();
    }
    #endif
    #if defined(TIM14_BASE)
    if (htim_pwm->Instance == TIM14) {
        __HAL_RCC_TIM14_CLK_DISABLE();
    }
    #endif
    #if defined(TIM15_BASE)
    if (htim_pwm->Instance == TIM15) {
        __HAL_RCC_TIM15_CLK_DISABLE();
    }
    #endif
    #if defined(TIM16_BASE)
    if (htim_pwm->Instance == TIM16) {
        __HAL_RCC_TIM16_CLK_DISABLE();
    }
    #endif
    #if defined(TIM17_BASE)
    if (htim_pwm->Instance == TIM17) {
        __HAL_RCC_TIM17_CLK_DISABLE();
    }
    #endif
    #if defined(TIM18_BASE)
    if (htim_pwm->Instance == TIM18) {
        __HAL_RCC_TIM18_CLK_DISABLE();
    }
    #endif
    #if defined(TIM19_BASE)
    if (htim_pwm->Instance == TIM19) {
        __HAL_RCC_TIM19_CLK_DISABLE();
    }
    #endif
    #if defined(TIM20_BASE)
    if (htim_pwm->Instance == TIM20) {
        __HAL_RCC_TIM20_CLK_DISABLE();
    }
    #endif
    #if defined(TIM21_BASE)
    if (htim_pwm->Instance == TIM21) {
        __HAL_RCC_TIM21_CLK_DISABLE();
    }
    #endif
    #if defined(TIM22_BASE)
    if (htim_pwm->Instance == TIM22) {
        __HAL_RCC_TIM22_CLK_DISABLE();
    }
    #endif
}

/**
 * @brief  This function will set the PWM to the required value
 * @param  port : the gpio port to use
 * @param  pin : the gpio pin to use
 * @param  clock_freq : frequency of the tim clock
 * @param  value : the value to push on the PWM output
 * @retval None
 */
void pwm_start(PinName pin, uint32_t PWM_freq, uint32_t value, TimerCompareFormat_t resolution) {}

/**
 * @brief  This function will disable the PWM
 * @param  port : the gpio port to use
 * @param  pin : the gpio pin to use
 * @retval None
 */
void pwm_stop(PinName pin) {}
#endif /* HAL_TIM_MODULE_ENABLED && !HAL_TIM_MODULE_ONLY */

#ifdef __cplusplus
}
#endif

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
